Учет_кабельной_продукции/src/Documents/ЗаданияНаЗакупку/ЗаданияНаЗакупку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаданияНаЗакупку</name>
  <posting>Deny</posting>
  <registerRecords>InformationRegister.ЗаданияНаЗакупкиСтатусы</registerRecords>
  <attributes>
    <name>Подрядчик</name>
    <type>
      <types>CatalogRef.Подрядчик</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>199</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусДокумента</name>
    <type>
      <types>EnumRef.СтатусыЗаданийНаЗакупку</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КабельныеЛинии</name>
    <attributes>
      <name>ЖурналУчетаКП</name>
      <type>
        <types>CatalogRef.ЖурналыУчетаКабельнойПродукции</types>
      </type>
    </attributes>
    <attributes>
      <name>КабельнаяЛиния</name>
      <type>
        <types>CatalogRef.КабельныеЛинии</types>
      </type>
    </attributes>
    <attributes>
      <name>Принято</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>199</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Учет_кабельной_продукции/src/Documents/ЗаданияНаЗакупку/ManagerModule.bsl
#Область Печать
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт

	КомандаПечати                                = КомандыПечати.Добавить();  
	КомандаПечати.МенеджерПечати                 = "Документ.ЗаданияНаЗакупку";
	КомандаПечати.Идентификатор                  = "ЗаданияНаЗакупки_01"; 
	КомандаПечати.МестоРазмещения                = "ПодменюПечать";
	КомандаПечати.Представление                  = Нстр("ru='Задания на закупки'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	
КонецПроцедуры

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	ПечатнаяФорма = УправлениеПечатью.СведенияОПечатнойФорме(КоллекцияПечатныхФорм, "ЗаданияНаЗакупки_01");
	
	Если ПечатнаяФорма <> Неопределено Тогда
		
		ПечатнаяФорма.ТабличныйДокумент = СформироватьПечать(МассивОбъектов);
		ПечатнаяФорма.СинонимМакета     = Нстр("ru='Задания на закупки'"); 
		ПечатнаяФорма.ПолныйПутьКМакету = "Документ.ЗаданияНаЗакупку.ПФ_MXL_ЗаданияНаЗакупки_01";
	КонецЕсли;
		
КонецПроцедуры

Функция СформироватьПечать(МассивОбъектов)
	
	ТабДокумент = Новый ТабличныйДокумент;	
	ТабДокумент.КлючПараметровПечати = "ПараметрыПечати_ЗаданияНаЗакупки_01";  
	ТабДокумент.АвтоМасштаб          = Истина;    
	ТабДокумент.ОриентацияСтраницы   = ОриентацияСтраницы.Ландшафт;
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ЗаданияНаЗакупку.ПФ_MXL_ЗаданияНаЗакупки_01");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", МассивОбъектов);	
	Запрос.Текст = "";
		
	Возврат ТабДокумент;
	
КонецФункции
#КонецОбласти

Функция ПолучитьБлокируемыеРеквизитыОбъекта() Экспорт
	
	Результат = Новый Массив;	
	Результат.Добавить("СтатусДокумента;ФормаЗаписать,ФормаУстановитьПометкуУдаления, ФормаАннулировать, ФормаСкан");
	Результат.Добавить("Комментарий");
	Результат.Добавить("Подрядчик");
	Результат.Добавить("КабельныеЛинии");
	Возврат Результат;
	
КонецФункции
